In [2]:
import pandas as pd

data = pd.read_csv("example-data-1.csv")
data

  kode_barang nama_barang jenis_barang  harga_satuan  jumlah
0        IDMF     Indomie         Food          2500       5
1        TROF        Taro         Food          6000       2
2        GODF    Good Day         Food          9000       1
3        DETN    Detergen     Non-food          4500       1
4        PGIN  Pasta Gigi     Non-food         12000       1
5        SGIN  Sikat Gigi     Non-food          2000       2

In [5]:
data = pd.read_csv("example-data-1.csv", index_col = "kode_barang")
data

            nama_barang jenis_barang  harga_satuan  jumlah
kode_barang
IDMF            Indomie         Food          2500       5
TROF               Taro         Food          6000       2
GODF           Good Day         Food          9000       1
DETN           Detergen     Non-food          4500       1
PGIN         Pasta Gigi     Non-food         12000       1
SGIN         Sikat Gigi     Non-food          2000       2

In [14]:
data = pd.read_csv("example-data-2.csv",header = None)
data

            0         1      2  3
0     Indomie      Food   2500  5
1        Taro      Food   6000  2
2    Good Day      Food   9000  1
3    Detergen  Non-food   4500  1
4  Pasta Gigi  Non-food  12000  1
5  Sikat Gigi  Non-food   2000  2

In [9]:
cols_name = ["nama_barang","jenis_barang","harga satuan","jumlah"]
data = pd.read_csv("example-data-2.csv",names=cols_name)
data

  nama_barang jenis_barang  harga satuan  jumlah
0     Indomie         Food          2500       5
1        Taro         Food          6000       2
2    Good Day         Food          9000       1
3    Detergen     Non-food          4500       1
4  Pasta Gigi     Non-food         12000       1
5  Sikat Gigi     Non-food          2000       2

In [11]:
data = pd.read_csv("mall-customers.csv")
data.columns = ["customer_id","gender","age","annual_income","spending_score"]
data.head()

   customer_id  gender  age  annual_income  spending_score
0            1    Male   19             15              39
1            2    Male   21             15              81
2            3  Female   20             16               6
3            4  Female   23             16              77
4            5  Female   31             17              40

In [12]:
# RENAME COLOM
# Inisiasi nama kolom

COLS_NAME = ["nama_barang","jenis_barang","harga_barang","jumlah_barang"]
data = pd.read_csv("mall-customers.csv", names = COLS_NAME)

data

           nama_barang jenis_barang        harga_barang   jumlah_barang
CustomerID       Genre          Age  Annual_Income_(k$)  Spending_Score
1                 Male           19                  15              39
2                 Male           21                  15              81
3               Female           20                  16               6
4               Female           23                  16              77
...                ...          ...                 ...             ...
196             Female           35                 120              79
197             Female           45                 126              28
198               Male           32                 126              74
199               Male           32                 137              18
200               Male           30                 137              83

[201 rows x 4 columns]

In [18]:
# Summary Data
data = pd.read_csv("example-data-1.csv")
data.shape

(6, 5)

In [23]:
# Get Top and Last Data
data = pd.read_csv("mall-customers.csv")
# data.head(10)
data.tail()

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83